Console.WriteLine("мяу мяу мяу калькулятор от артема из п50-5-22");
double a, b;
string oper;
while (true)
{
    Console.WriteLine("Выберите действие");
    Console.WriteLine("1. Сложить 2 числа(+)\r\n2. Вычесть первое из второго(-)\r\n3. Перемножить два числа(*)\r\n4. Разделить первое на второе(/)\r\n5. Возвести в степень N первое число(**)\r\n6. Найти квадратный корень из числа(sqrt)\r\n7. Найти 1 процент от числа(%)\r\n8. Найти факториал из числа(!)\r\n9. Выйти из программы(q)");
    oper = Console.ReadLine();
    if (oper != "")
}

